export const review = [
  {
    profile: "/profile.png",
    name: "김재훈 님",
    team: "indie-n-bob",
    content:
      "프로젝트를 2회 가량 함께 하면서 항상 뛰어난 소통 능력과 개발 실력을 보여주었습니다. 언제나 명확하고 효과적인 커뮤니케이션 덕분에 프로젝트가 순조롭게 진행 되었고, 팀 내에서도 필요한 정보를 빠르게 공유할 수 있었습니다. 또한, 복잡한 문제를 해결하는 데 있어 탁월한 역량을 가지고 있으며, 끈기 있게 끝까지 최선을 다하는 모습이 매우 인상적이었습니다. 프로젝트를 함께 할 수 있어서 정말 좋았고, 많이 배웠던 것 같습니다. 앞으로의 행보가 기대되는 프론트엔드 개발자 입니다.",
  },
  {
    profile: "/profile.png",
    name: "이가현 님",
    team: "향그리움",
    content:
      "제가 잘 몰랐던 부분에서 도움을 받을 수 있어서 너무 감사했고 프로젝트 기간중에 어떤 문제점이 생기거나 발견했을때 소통이 잘 돼서 좋았어요. 겹치는 부분들이 있었는데 먼저 배려해주시고 다른 팀원들 사용하기에 편하게 셋팅해주시는거 보고 배워야 할 점이라고 생각했어요. 그리고 이준님이 한번씩 툭툭 던지는 그 말이 너무 웃겨요..(유머감각 최고..) 생각하지도 못한 부분에서도 항상 아이디어를 주시는 이준님은 최최고",
  },

  {
    profile: "/profile.png",
    name: "선지원 님",
    team: "indie-n-bob",
    content:
      "좋았던 점은 담당했던 부분(로그인/회원가입)이 다른 기능보다 선행되어야 했는데 아주 빠른 시간에 구현을 완료해주셔서 나머지 부분들에 대한 진행이 수월했습니다 ~ 디자인이나 기능에 대한 피드백도 적극적으로 수용해주어서 편하게 프로젝트를 진행할 수 있었습니다!",
  },
  {
    profile: "/profile.png",
    name: "최혜미 님",
    team: "향그리움",
    content:
      "무엇보다 큰 장점은 커뮤니케이션이 아주 잘 됩니다. 팀 내 필요한 기능이 있으면 이준님께 부탁했었던 것 같아요 심지어 손도 빠르셔서 놀랐어요. 그리고 컴포넌트 분리가 깔끔해서 초반에 많이 참고했습니다. 어색한 팀 분위기를 항상 풀어주시면서 팀 내 분위기 메이커 역할을 해주셔서 프로젝트를 진행하는 동안 해피 코딩할 수 있었습니다!",
  },
  {
    profile: "/profile.png",
    name: "홍유나 님",
    team: "cream",
    content:
      "뭔가 성격이 시원시원하고 강단이 있는 성격이라 고민이 있거나 선택이 필요한 시점에서 이준님이 많이 도움이 됐었습니다. 귀찮게 느껴질 수 있는 부분(공통 컴포넌트, 반응형 등)을 먼저 나서서 해주셔서 감사했습니다. 덕분에 완성도 있는 프로젝트를 만들 수 있었던 것 같아요!",
  },
  {
    profile: "/profile.png",
    name: "양민애 님",
    team: "개발참십조",
    content:
      "코딩이 처음이라 아무것도 모를 때 같은 프로젝트를 이준님과 같이 진행할 수 있어서 너무 좋았습니다. 우선 리드해줘서 너무 좋았어요. 그때는모르는게 많아서 의지가 되었던 것 같아요! 이준님 덕분에 첫번째 프로젝트 잘 끝낼 수 있었습니다! 멱살잡고 끌고와줘서 너무 고마웠어요",
  },
  {
    profile: "/profile.png",
    name: "김래준 님",
    team: "매니저",
    content:
      "이준님은 매번 말 걸면 너무 밝게 잘 대답해주셔서 너무 좋았어요 이준님 실력도 캠프 초반에 비하면 비교할 수도 없게 향상되셨겠죠? 지금처럼 스트레이트로 달려주세요! 이준님은 분명 좋은 곳에 입사하게 될거에요! 항상 응원합니다 화이팅 :)",
  },
  {
    profile: "/profile.png",
    name: "유수지 님",
    team: "개발참십조",
    content:
      "이준님은 항상 캠을 켜고 자리를 지키며 열심히 하시는 모습을 보면서 저도 열심히 해야겠다는 동기부여를 얻었습니당!! 부트캠프에서 첫 번째로 함께한 팀 프로젝트에서, 비전공자인 저는 모르는 것이 많았지만, 개발에 대해 더 많은 지식을 가진 이준님 덕분에 많은 도움이 된것같아용!! 질문할 때마다 친절하게 답변해 주셔서, 프로젝트를 보다 수월하게 마무리할 수 있었던 것 같습니다. ㅎㅎ ",
  },
  {
    profile: "/profile.png",
    name: "박솔 님",
    team: "indie-n-bob",
    content:
      "어떠한 기능을 맡기더라도 어떻게든 해내고, 심지어 속도도 빠르게 잘 진행하시는 점이 프로젝트 하면서 너무 좋았습니다. 대박 최고의 장점이라고 생각해요. 그리고 대화가 잘되어서 프로젝트를 진행하면서 소통이 즐거웠습니다.",
  },
];

export const interview = [
  {
    question: "Q. 프론트엔드로 전향한 이유가 있나요?",
    answer:
      "웹디자이너와 웹퍼블리셔로서 일하면서, 사용자 경험과 디자인의 중요성을 깊이 이해하게 되었습니다. 이러한 경험을 바탕으로, 디자인과 기술을 결합하여 사용자에게 더 나은 경험을 제공할 수 있는 방법을 찾게 되었습니다. 특히, 프론트엔드 개발은 이러한 사용자 중심의 디자인을 기술적으로 구현할 수 있는 분야로, 저의 창의성과 문제 해결 능력을 발휘할 수 있는 매력적인 도전이라고 느꼈습니다. 웹사이트를 코드로 직접 구축하고 개선하는 과정에서 기술적인 성취감과 창의적인 만족감을 동시에 얻을 수 있었습니다. 이러한 이유로 프론트엔드 개발자로 전향하게 되었습니다.",
  },
  {
    question:
      "Q. 프론트엔드 개발자로서 일에서 가장 중요하게 느끼는 것은 무엇인가요?",
    answer:
      "프론트엔드 개발자로서 가장 중요하게 생각하는 것은 사용자 경험입니다. 사용자가 웹 애플리케이션을 사용할 때 직관적이고 원활한 경험을 제공하는 것이 핵심입니다. 이를 위해 UI/UX 디자인의 원칙을 철저히 이해하고, 성능 최적화와 접근성을 고려한 개발이 필수적이라고 생각합니다. 또한, 빠르게 변화하는 기술 트렌드를 지속적으로 학습하고, 팀원들과의 긴밀한 협업을 통해 다양한 아이디어를 반영하는 것도 매우 중요하다고 믿습니다. 이러한 요소들이 결합될 때, 최종적으로 사용자에게 진정한 가치를 제공할 수 있다고 확신합니다.",
  },
  {
    question: "Q. 앞으로의 포부는 무엇인가요?",
    answer:
      "앞으로는 사용자 중심의 혁신적인 웹 애플리케이션을 개발하며 지속적으로 성장하고자 합니다. 최신 기술을 익히고 다양한 프로젝트에 참여하면서 실력을 향상시키는 동시에, 팀원들과의 협업을 통해 효과적인 커뮤니케이션을 유지하며 함께 성장하는 문화를 만들어가겠습니다. 또한, 코드 리뷰와 지식 공유를 통해 팀 전체의 역량을 강화하는 데 기여하고 싶습니다. 이렇게 발전하는 프론트엔드 개발자가 되어 사용자에게 가치를 제공하는 경험을 만들어 나가는 데 최선을 다하겠습니다.",
  },
];

export const career = [
  {
    date: "2020.06 - 2022.03",
    company: "(주) 글로벌엠아이지",
    position: "웹개발디자인팀/팀장",
    contents: [
      "Photoshop, Illustrator를 활용한 웹사이트, 상세페이지, 광고 콘텐츠 제작",
      "HTML, CSS, JavaScript를 사용해 광고주 웹사이트 디자인 및 퍼블리싱",
      "기획자 및 프론트엔드(외주) 개발자와 지속적인 커뮤니케이션",
      "광고주 웹사이트 유지보수",
      "클라이언트와 직접적인 소통으로 프로젝트 구체화",
      "광고 콘텐츠 제작으로 광고 목표 매출 2000% 달성",
    ],
  },
  {
    date: "2022.06 - 2022.11",
    company: "(주) 에스앤에스랩",
    position: "디자인팀/팀원",
    contents: [
      "Photoshop, Illustrator 를 활용한 웹사이트, 상세페이지, 인스타그램 피드 제작",
      "html, css, javascript 를 사용해 자사 웹사이트 디자인 및 퍼블리싱",
      "기획자와 지속적인 커뮤니케이션으로 프로젝트 구체화",
      "자사 법인 5개 웹사이트 제작 및 유지보수",
    ],
  },
  {
    date: "2022.11 - 2023.11",
    company: "(주) 에이와웰리브",
    position: "디자인팀/팀원(주임)",
    contents: [
      "Photoshop, Illustrator 를 활용한 웹사이트, 상세페이지, 인스타그램 피드 제작",
      "html, css, javascript 를 사용해 자사 웹사이트 디자인 및 퍼블리싱",
      "기획자와 지속적인 커뮤니케이션으로 프로젝트 구체화",
      "자사 법인 5개 웹사이트 제작 및 유지보수",
    ],
  },
  {
    date: "2023.11 - 2024.02",
    company: "(주) 에스앤에스랩",
    position: "디자인팀/팀원(주임)",
    contents: [
      "Photoshop, Illustrator 를 활용한 웹사이트, 상세페이지, 인스타그램 피드 제작",
      "html, css, javascript 를 사용해 자사 웹사이트 디자인 및 퍼블리싱",
      "기획자와 지속적인 커뮤니케이션으로 프로젝트 구체화",
      "자사 법인 5개 웹사이트 제작 및 유지보수",
    ],
  },
];

export const project = [
  {
    id: "1",
    image: "/project/project1.png",
    projectName: "향그리움",
    projectContent:
      "전통시장 홍보와 특산물을 판매하는 커머스&커뮤니티 웹사이트",
    description:
      "전통시장에서 운영하고 있는 편의시설 및 위치정보를 얻을 수 있으며, 채팅을 통해 실시간 전통시장의 상황을 파악할 수 있습니다.",
    url: [
      "https://k-nostalgia-one.vercel.app",
      "https://github.com/ejunyang/K-nostalgia",
    ],
    date: "2024.07.15 - 2024.08.21",
    skill: [
      "React",
      "Nextjs",
      "Typescript",
      "TailwindCSS",
      "TanstackQuery",
      "Supabase",
    ],
    function:
      "찾고있는 시장의 위치와 이미지, 편의시설을 확인할 수 있습니다. 또한 각 시장의 특산물을 즉시 구매할 수 있으며, 실시간 채팅으로 시장의 실시간 정보를 얻을 수 있습니다.",
    contribution: [
      {
        title: "프로젝트 아이디어 도출 및 기획 구성",
        contents: [
          "Figma을 활용하여 팀원들과 함께 와이어프레임 작업을 진행하고, 벤치마킹을 통해 아이디어를 구체화했습니다. 다양한 디자인 사례를 분석하여 최적의 사용자 경험을 이끌어낼 수 있는 방향으로 기획했습니다.",
        ],
      },
      {
        title: "커스텀 훅 작업",
        contents: [
          "사용자 입력에 대한 반응성을 개선하기 위해 커스텀 훅인 useDebounce를 활용하여 입력값의 변경을 디바운싱 처리하였습니다. 이로써 불필요한 렌더링을 줄이고, 성능을 최적화할 수 있었습니다.",
          "react-responsive 라이브러리를 사용하여 미디어 쿼리를 기반으로 디바이스 크기 감지를 위해 useDeviceSize 커스텀 훅을 구현하였으며, 이를 통해 화면 크기에 맞춰 컴포넌트의 렌더링을 조정할 수 있습니다.",
        ],
      },
      {
        title: "공통 컴포넌트 작업",
        contents: [
          "재사용성을 위해 Loading, DefaultImage, Alert, FilterButton 등 컴포넌트를 작업했습니다.",
        ],
      },
      {
        title: "메인 페이지",
        contents: [
          "Shadcn/ui의 Carousel 컴포넌트를 사용하여 메인 배너 슬라이드를 구현하였습니다. 이를 통해 시각적으로 매력적인 콘텐츠를 사용자에게 효과적으로 전달하였습니다.",
          "React Swiper를 활용하여 인디케이터 디자인을 커스터마이즈한 슬라이드를 구현하여 사용자에게 더 나은 네비게이션 경험을 제공하였습니다.",
        ],
      },
      {
        title: "특산물 페이지",
        contents: [
          "Supabase에 저장된 특산물 데이터를 불러와 리스트 형태로 렌더링하여 사용자가 쉽고 빠르게 정보를 확인할 수 있도록 하였습니다.",
          "특산물 항목별로 리스트업할 수 있는 필터링 버튼을 구현하여 사용자 편의성을 높였습니다. 이를 통해 사용자는 원하는 제품을 손쉽게 찾을 수 있습니다.",
        ],
      },
      {
        title: "특산물 디테일 페이지",
        contents: [
          "상품명, 가격, 수량 등을 명확히 표시하여 사용자가 필요한 정보를 쉽게 확인할 수 있도록 하였습니다.",
          "구매하기 버튼 클릭 시 바텀시트에서 수량 조정이 가능하도록 설계하였으며, 최소 수량을 1개로 설정하고 1개 이하일 경우 토스트 알림을 통해 모바일 최적화했습니다.",
          "상세정보와 리뷰 두 가지 탭을 제공하여 정보 접근성을 높였고, PC에서는 스크롤 이동이 가능하도록 하여 사용자 경험을 개선하였습니다.",
          "성능 최적화와 사용자 경험 향상을 위해 리뷰를 pagination로 구현하여 부하를 최소화하였습니다.",
        ],
      },
      {
        title: "장바구니",
        contents: [
          "체크한 상품만 구매하거나 삭제할 수 있도록 구현하여 사용자의 선택권을 강화하였습니다.",
          "수량 증가 시 금액이 자동으로 업데이트되도록 연결하여 사용자에게 실시간으로 정확한 정보를 제공하였습니다.",
        ],
      },
    ],
    trouble: [],
  },
  {
    id: "2",
    image: "/project/project2.png",
    projectName: "인디안밥",
    projectContent: "인디밴드 커뮤니티 웹사이트",
    description:
      "독립적으로 활동하는 인디밴드가 본인의 공연 및 앨범을 홍보하고 사용자들은 본인이 좋아하는 곡, 밴드, 좋았던 공연을 공유하는 커뮤니티 사이트 입니다.",
    url: [
      "https://indie-n-bob.vercel.app/",
      "https://github.com/ejunyang/indie-n-bob",
    ],
    date: "2024.07.08 - 2024.07.15",
    skill: [
      "React",
      "Nextjs",
      "Typescript",
      "TailwindCSS",
      "TanstackQuery",
      "Bootstrap",
    ],
    function:
      "인디밴드 커뮤니티 사이트는 일반 사용자와 관리자 선택 회원가입 가능하며 일반 사용자의 경우 자유게시판에 곡 및 공연 정보를 공유하고, 관리자는 공연 일정을 등록하는 기능을 제공합니다.",
    contribution: [
      {
        title: "프로젝트 아이디어 도출 및 기획 구성",
        contents: [
          "Figma을 활용하여 팀원들과 함께 와이어프레임 작업을 진행하고, 벤치마킹을 통해 아이디어를 구체화했습니다. 다양한 디자인 사례를 분석하여 최적의 사용자 경험을 이끌어낼 수 있는 방향으로 기획했습니다.",
        ],
      },
      {
        title: "웹 디자인 경험 기반 전반적인 디자인 총괄",
        contents: [
          "전체 UI 디자인을 담당하며, 사용자의 편리함을 고려한 직관적인 인터페이스를 구현했습니다. UX 개선을 위해 팀원들과 협업하여 피드백을 반영하고 디자인을 수정했습니다.",
        ],
      },
      {
        title: "공통 컴포넌트 작업",
        contents: [
          "재사용성을 위해 Loading, Alert 등 컴포넌트를 작업했습니다.",
        ],
      },
      {
        title: "로그인 유무에 따른 header 레이아웃 작업",
        contents: [
          "사용자가 로그인했을 경우, 로그인한 사용자의 프로필 이미지와 닉네임을 헤더에 표시하도록 구현했습니다.",
          "로그인 상태에 따라 헤더의 레이아웃을 동적으로 변경하여, 비로그인 상태에서는 로그인 및 회원가입 버튼을, 로그인 상태에서는 사용자 정보를 보여주는 UI를 제공했습니다.",
        ],
      },
      {
        title: "로그인",
        contents: [
          "사용자가 입력한 이메일이 기존 등록된 이메일 목록에 포함되어 있는지 확인합니다.",
          "로그인 실패 시, 사용자에게 에러 메시지를 표시하며 잘못된 비밀번호나 존재하지 않는 계정에 대한 안내를 제공합니다.",
          "로그인 후, 사용자 정보를 세션에 저장하여 인증된 상태를 유지하며, 모바일 환경에서도 사용자 친화적인 UI를 제공하기 위해 입력 필드와 버튼 크기를 조절하여 편리한 사용 경험을 제공합니다.",
        ],
      },
      {
        title: "회원가입",
        contents: [
          "이름, 이메일, 비밀번호, 일반사용자/관리자, 좋아하는 아티스트 등의 필드를 포함한 회원가입 폼 UI를 구현했습니다.",
          "사용자 계정에 관리자와 일반 사용자 역할을 부여하여 기능 접근을 차별화했습니다.",
          "모바일 환경에서도 편리하게 사용할 수 있도록 UI 최적화를 진행했습니다.",
          "사용자가 선호하는 아티스트를 추가할 수 있는 기능을 구현했습니다. 또한 중복된 아티스트 추가를 방지하여 데이터의 일관성을 유지할 수 있습니다.",
        ],
      },
      {
        title: "미들웨어 활용",
        contents: [
          "Next.js의 미들웨어를 사용하여 인증 및 권한 관리를 강화했습니다. 이를 통해 로그인 및 회원가입 과정에서의 보안성을 높이고, 사용자 경험을 개선했습니다.",
        ],
      },
    ],
    trouble: [
      {
        title: "로그인 및 회원가입",
        problem:
          "로그인 인증 상태를 확인하기 위해 매번 서버에 요청을 보내야 했고, 이로 인해 페이지 로딩 속도가 느려지고 사용자 경험이 저하되었습니다.",
        cause:
          "서버에 대한 반복적인 요청은 네트워크 지연과 서버 부하를 증가시켜, 사용자가 페이지를 로드하는 데 필요한 시간이 길어지게 만들었습니다. 또한, 클라이언트 측에서 인증 상태를 관리하지 않음으로써 불필요한 요청이 발생했습니다.",
        solve:
          "미들웨어를 사용하여 인증 상태를 세션이나 쿠키에 저장하고, 이를 기반으로 요청을 처리함으로써 페이지 로딩 속도를 개선하고 사용자 경험을 향상시켰습니다. 이를 통해 서버 요청 수를 줄이고, 클라이언트 측에서 빠르게 인증 상태를 확인할 수 있게 되었습니다.",
      },

      {
        title: "게시글 업데이트",
        problem:
          "게시글 생성 후 리스트 페이지에 가보면 업데이트가 되지 않는 현상이 발생했습니다.",
        cause:
          "게시글 목록을 가져오는 코드에서 Supabase 클라이언트를 import { createClient } from @/utils/supabase/client로 사용하고 있었기 때문에, 서버에서 데이터 변경 사항을 실시간으로 반영하지 못했습니다.",
        solve:
          "import { createClient } from @/utils/supabase/server로 변경하여 서버 클라이언트를 사용하여 데이터 요청을 처리하니 게시글 목록이 정상적으로 업데이트되었습니다. 클라이언트와 서버 클라이언트의 차이를 이해하고 올바른 클라이언트를 사용함으로써, 게시글 생성 후 리스트 페이지가 정상적으로 업데이트되는 문제를 해결했습니다.",
      },
    ],
  },

  {
    id: "3",
    image: "/project/project4.png",
    projectName: "Cream",
    projectContent: "아이스크림 덕후 커뮤니티 웹사이트",
    description:
      "아이스크림 덕후 커뮤니티 웹사이트는 다양한 아이스크림 맛과 브랜드에 대한 리뷰를 공유하고, 추천을 통해 새로운 아이스크림 경험을 나누는 플랫폼입니다.",
    url: ["#", "https://github.com/ejunyang/cream"],
    date: "2024.05.31 - 2024.06.07",
    skill: ["React", "React Router", "Styled Components", "Redux", "Supabase"],
    function:
      "아이스크림 애호가들이 모여 다양한 아이스크림 경험을 공유하고 서로의 추천을 받을 수 있는 온라인 플랫폼입니다. 회원들은 자신이 좋아하는 아이스크림 맛, 브랜드에 대한 리뷰를 작성하며 아이스크림에 대한 정보를 나눌 수 있습니다.",
    contribution: [
      {
        title: "프로젝트 아이디어 도출 및 기획 구성",
        contents: [
          "Figma을 활용해 팀원들과 와이어프레임 작업 및 벤치마킹을 통해 아이디어를 구체화했습니다.",
          "Supabase를 사용하여 필요한 테이블을 구성하여 데이터 모델을 설계했습니다.",
        ],
      },
      {
        title: "웹 디자인 경험 기반 전반적인 디자인 총괄",
        contents: [
          "전체 UI 디자인을 담당하며, 사용자의 편리함을 고려한 직관적인 인터페이스를 구현했습니다. UX 개선을 위해 팀원들과 협업하여 피드백을 반영하고 디자인을 수정했습니다.",
        ],
      },
      {
        title: "반응형 구현",
        contents: [
          "다양한 디바이스에서 최적의 사용자 경험을 제공하기 위해 반응형 디자인을 구현했습니다. CSS 미디어 쿼리를 활용하여 화면 크기에 따라 레이아웃과 요소들을 조정했습니다. 이를 통해 모바일과 데스크탑 환경 모두에서 원활한 접근성을 확보했습니다.",
        ],
      },
      {
        title: "마이 페이지 닉네임 수정",
        contents: [
          "useRef를 사용하여 기존 닉네임을 불러와 초기값으로 설정 후 닉네임 수정 기능을 구현했습니다. 입력 필드의 값이 변경되더라도 컴포넌트가 다시 렌더링되지 않아 더욱 효율적인 사용자 경험을 제공합니다.",
        ],
      },
    ],
    trouble: [],
  },
  {
    id: "4",
    image: "/project/project5.png",
    projectName: "가계부",
    projectContent: "월별 개인 지출 내역 관리 웹사이트",
    description:
      "로그인한 사용자가 개인 지출을 월별로 등록, 수정, 삭제할 수 있으며, 지출 내역을 시각적으로 분석하고 관리할 수 있는 웹사이트입니다.",
    url: [
      "https://expend-management-advanced.vercel.app/",
      "https://github.com/ejunyang/expend-management-advanced",
    ],
    date: "2024.06.10 - 2024.06.14",
    skill: ["React", "Styled Components", "ContextAPI", "Json Web Token"],
    function:
      "사용자는 월별로 지출 내역을 간편하게 등록, 수정 및 삭제할 수 있는 기능을 제공합니다. 이 시스템은 로컬 스토리지를 활용하여 사용자가 마지막으로 선택한 월을 저장함으로써, 페이지를 새로 고침하거나 종료한 후에도 해당 정보를 유지할 수 있습니다. 또한, 각 월별 총 지출 금액을 시각적으로 표현하여 사용자가 자신의 지출 패턴을 쉽게 파악할 수 있도록 돕습니다.",
    contribution: [
      {
        title: "웹 디자인 경험 기반 전반적인 디자인",
        contents: [
          "다양한 프로젝트를 통해 쌓은 경험을 바탕으로, 사용자 중심의 직관적인 디자인을 구현하였습니다.",
          "색상, 타이포그래피 및 레이아웃을 조화롭게 구성하여 시각적으로 매력적이고 일관된 사용자 경험을 제공하였습니다.",
        ],
      },
      {
        title: "월별 개인 지출 관리 페이지",
        contents: [
          "각 월을 선택할 수 있는 UI를 구현하여 사용자가 손쉽게 원하는 월의 지출 내역을 조회할 수 있도록 하였습니다.",
          "총 지출한 금액을 강조하여 표시하여 사용자가 한눈에 자신의 지출 상황을 확인할 수 있게 하였습니다.",
          "localstorage를 활용하여 페이지를 껐다 켜도 마지막으로 선택했던 월을 저장하여, 사용자가 이전 상태를 쉽게 복원할 수 있도록 하였습니다.",
        ],
      },
      {
        title: "로그인/회원가입",
        contents: [
          "JWT(JSON Web Token)를 사용하여 로그인 및 회원가입 기능을 구현하였습니다. 이를 통해 사용자의 인증 및 인가 과정을 안전하고 효율적으로 처리할 수 있게 하였습니다.",
          "사용자 친화적인 로그인 및 회원가입 UI를 설계하여 사용자 경험을 개선 하였으며, 입력 오류에 대한 즉각적인 피드백을 제공하여 사용자가 쉽게 가입하고 로그인할 수 있도록 하였습니다.",
          "인증된 사용자에게만 접근할 수 있는 페이지를 설정하여 보안성을 강화하였습니다.",
        ],
      },
    ],
    trouble: [],
  },
];
